app/controllers/authentications_controller.rb

def register
  user = User.new(user_params)
  if user.save
---
INSERT INTO "users" ("username", "first_name", "last_name", "email", "password_digest", "diving_level", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

def login
  user = User.find_by_email(params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "olly@hotmail.com"], ["LIMIT", 1]]