app/controllers/dive_sites_controller.rb

SELECT "dive_sites".* FROM "dive_sites"
---
  def index
    @dive_sites = DiveSite.all

INSERT INTO "dive_sites" ("name", "image", "water_type", "lat", "lng", "max_depth", "created_at", "updated_at", "country", "dive_type") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @dive_site = DiveSite.new(dive_site_params)

    if @dive_site.save

UPDATE "dive_sites" SET "water_type" = $1, "lat" = $2, "lng" = $3, "updated_at" = $4 WHERE "dive_sites"."id" = $5  [["water_type", "Fresh Water "], ["lat", -16.722822594682576], ["lng", 146.28601854504393], ["updated_at", "2017-07-27 13:38:31.242268"], ["id", 1]]
---
  def update
    if @dive_site.update(dive_site_params)

DELETE FROM "dive_sites" WHERE "dive_sites"."id" = $1  [["id", 2]]
---
  def destroy
    @dive_site.destroy

SELECT  "dive_sites".* FROM "dive_sites" WHERE "dive_sites"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_dive_site
      @dive_site = DiveSite.find(params[:id])