app/controllers/logs_controller.rb

SELECT "logs".* FROM "logs"
---
  def index
    @logs = Log.all

INSERT INTO "logs" ("date", "user_id", "dive_site_id", "dive_time", "gear", "comments", "visibility", "temperature", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @log = Log.new(log_params)

    if @log.save

UPDATE "logs" SET "dive_site_id" = $1, "image" = $2, "updated_at" = $3 WHERE "logs"."id" = $4  [["dive_site_id", 2], ["image", "bb39da0267aeff1d650f195c1d9c76ab.jpeg"], ["updated_at", "2017-07-27 23:37:15.377356"], ["id", 1]]
---
  def update
    if @log.update(log_params)

SELECT  "logs".* FROM "logs" WHERE "logs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_log
      @log = Log.find(params[:id])