app/controllers/oauth_controller.rb

  def facebook
    token = HTTParty.post('https://graph.facebook.com/v2.8/oauth/access_token', {
      query: {
        client_id: ENV["FACEBOOK_APP_ID"],
        redirect_uri: 'http://localhost:7000/',
        client_secret: ENV["FACEBOOK_APP_SECRET"],
        code: params[:code]
      },
      headers: { 'Accept' => 'application/json'}
      }).parsed_response


    profile = HTTParty.get('https://graph.facebook.com/v2.8/me?fields=id,name,email', {
      query: token,
      headers: {
        'User-Agent' => 'HTTParty',
        'Accept' => 'application/json'
      }
      }).parsed_response


        user = User.where("email = :email OR facebook_id = :facebook_id", email: profile["email"], facebook_id: profile["id"]).first

        user = User.new username: profile["name"], email: profile["email"] unless user

        user[:facebook_id] = profile["id"]

        if user.save
---
SELECT  "users".* FROM "users" WHERE (email = 'ollylikesmetallica@hotmail.com' OR facebook_id = '10150841818869946') ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "users" ("username", "email", "facebook_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"